'''Создать список из десяти целых чисел.
Вывести на экран каждое число, увеличенное на 1.'''


lada=[1,2,3,4,5,6,7,8,9,10]

 

for a in lada:

    print(a+1)