'''Ввести с клавиатуры строку.
Вывести эту же строку вертикально: по одному символу на строку консоли.'''

line_1=input('Write the line  ')

for a1 in line_1:
    print(a1)


