'''
Пройдите в цикле по списку ["Вася", "Маша", "Петя", "Валера", "Саша", "Даша"] пока не встретите имя "Валера". Когда найдете напишите "Валера нашелся".
'''


names=["Вася", "Маша", "Петя", "Валера", "Саша", "Даша"]
count=0
while names:
    print(names)
    if names.pop()=='Валера':
        
        print('Валера нашелся')
        break
  




'''


#Старый код


names=["Вася", "Маша", "Петя", "Валера", "Саша", "Даша"]
count=0
while True:
    name=names[count]
    print('count  ', count,'name ', name)
    if name=='Валера':
      print('Валера нашелся')
      break
    else:
        count+=1
'''